#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_record.www: Refreshing state... [id=5fc238fa91915e581cb8c4e09c159f52]
cloudflare_filter.countries: Refreshing state... [id=fee73ed1082943dfa392778faa1ffa42]
cloudflare_record.ipv4: Refreshing state... [id=da32eaa95b00bd3c354e643118d32078]
cloudflare_zone_settings_override.cloudflare_settings: Refreshing state... [id=6dbf018cb5f882a1e74d770fe5676aa8]
cloudflare_firewall_rule.countries: Refreshing state... [id=b6dc3ee333b9450db2e154942b4f3d62]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # cloudflare_firewall_rule.countries has changed
  ~ resource "cloudflare_firewall_rule" "countries" {
        id          = "b6dc3ee333b9450db2e154942b4f3d62"
      + products    = []
        # (6 unchanged attributes hidden)
    }

  # cloudflare_record.ipv4 has been deleted
  - resource "cloudflare_record" "ipv4" {
      - allow_overwrite = false -> null
      - created_on      = "2023-03-27T18:12:27.192438Z" -> null
      - hostname        = "ipv4.falsebit.io" -> null
      - id              = "da32eaa95b00bd3c354e643118d32078" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2023-03-27T18:12:27.192438Z" -> null
      - name            = "ipv4" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "13.91.160.244" -> null
      - zone_id         = "6dbf018cb5f882a1e74d770fe5676aa8" -> null
    }

  # cloudflare_record.www has been deleted
  - resource "cloudflare_record" "www" {
      - allow_overwrite = false -> null
      - comment         = "" -> null
      - created_on      = "2023-03-27T18:12:27.630637Z" -> null
      - hostname        = "www.falsebit.io" -> null
      - id              = "5fc238fa91915e581cb8c4e09c159f52" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2023-03-27T18:12:27.630637Z" -> null
      - name            = "www" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = (sensitive) -> null
      - zone_id         = "6dbf018cb5f882a1e74d770fe5676aa8" -> null
    }

  # cloudflare_zone_settings_override.cloudflare_settings has changed
  ~ resource "cloudflare_zone_settings_override" "cloudflare_settings" {
        id                       = "6dbf018cb5f882a1e74d770fe5676aa8"
        # (6 unchanged attributes hidden)

      ~ settings {
          + binary_ast                  = "off"
          ~ browser_cache_ttl           = 0 -> 14400
          + cache_level                 = "aggressive"
          + cname_flattening            = "flatten_at_root"
          ~ development_mode            = "on" -> "off"
          + early_hints                 = "off"
          + filter_logs_to_cloudflare   = "off"
          + h2_prioritization           = "off"
          + http2                       = "on"
          + image_resizing              = "off"
          + log_to_cloudflare           = "on"
          ~ max_upload                  = 0 -> 100
          + mirage                      = "off"
          + orange_to_orange            = "off"
          + origin_error_page_pass_thru = "off"
          + polish                      = "off"
          + prefetch_preload            = "off"
          + proxy_read_timeout          = "100"
          + response_buffering          = "off"
          + sort_query_string_for_cache = "off"
          + tls_1_2_only                = "off"
          + tls_client_auth             = "off"
          + true_client_ip_header       = "off"
          + visitor_ip                  = "on"
          + waf                         = "off"
            # (26 unchanged attributes hidden)


          + mobile_redirect {
              + status    = "off"
              + strip_uri = false
            }

            # (2 unchanged blocks hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.ipv4 will be created
  + resource "cloudflare_record" "ipv4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ipv4"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "20.172.4.96"
      + zone_id         = "6dbf018cb5f882a1e74d770fe5676aa8"
    }

  # cloudflare_record.root will be created
  + resource "cloudflare_record" "root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (sensitive)
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (sensitive)
      + zone_id         = "6dbf018cb5f882a1e74d770fe5676aa8"
    }

  # cloudflare_record.www will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (sensitive)
      + zone_id         = "6dbf018cb5f882a1e74d770fe5676aa8"
    }

  # cloudflare_zone_settings_override.cloudflare_settings will be updated in-place
  ~ resource "cloudflare_zone_settings_override" "cloudflare_settings" {
        id                       = "6dbf018cb5f882a1e74d770fe5676aa8"
        # (6 unchanged attributes hidden)

      ~ settings {
          ~ development_mode            = "off" -> "on"
            # (50 unchanged attributes hidden)



            # (3 unchanged blocks hidden)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`*